Repository: fatkhullakh/navbatuz-frontend
Catalog: lib/l10n/app_*.arb
Languages: uz

# no_services_assigned
source: No services are assigned to this worker.
uz: Bu xodimga hech qanday xizmat biriktirilmagan.

# contacts_not_supported
source: Contacts not supported on this platform
uz: Ushbu platformada kontaktlar qo‘llab-quvvatlanmaydi

# contacts_permission_denied
source: Contacts permission denied. Enable it in Settings > App > Permissions.
uz: Kontaktlarga ruxsat berilmagan. Ilova sozlamalaridan ruxsat bering.

# no_provider_for_clients
source: No provider to list clients from
uz: Mijozlar ro‘yxati uchun xizmat ko‘rsatuvchi tanlanmagan

# choose_service_validation
source: Choose a service
uz: Xizmatni tanlang

# breaksTitle
source: Add / Manage breaks
uz: Tanaffuslar: qo‘shish / boshqarish

# workerLabel
source: Worker
uz: Hodim

# dateLabel
source: Date
uz: Sana

# todayButton
source: Today
uz: Bugun

# timeStartLabel
source: Start
uz: Boshlanishi

# timeEndLabel
source: End
uz: Tugashi

# saveBreakBtn
source: Save break
uz: Tanaffusni saqlash

# savingEllipsis
source: Saving…
uz: Saqlanmoqda…

# existingBreaksTitle
source: Existing breaks
uz: Ushbu kundagi tanaffuslar

# noBreaksForDay
source: No breaks for this day.
uz: Bu kunda tanaffus yo‘q.

source: Break saved
uz: Tanaffus saqlandi

source: Break deleted
uz: Tanaffus o‘chirildi

# breakSaveFailed
source: Save failed: {error}
uz: Saqlash muvaffaqiyatsiz: {error}

# breakDeleteFailed
source: Delete failed: {error}
uz: O‘chirish muvaffaqiyatsiz: {error}

# breakRequiredFields
source: Choose worker, start and end time
uz: Hodim, boshlanish va tugash vaqtlarini tanlang

# breakEndAfterStart
source: End time must be after start time
uz: Tugash vaqti boshlanishidan keyin bo‘lishi kerak

# pickTime5mTitle
source: Pick time (5-min)
uz: Vaqtni tanlash (5 daq.)

# commonCancel
source: Cancel
uz: Bekor qilish

# deleteAction
source: Delete
uz: O‘chirish

# owner_worker_profile
source: Your worker profile
uz: Sizning xodim profilingiz

# me_label
source: Me
uz: Men

# status_inactive
source: Inactive
uz: Nofaol

source: My availability
uz: Mening ish jadvalim

source: My services
uz: Mening xizmatlarim

# work_as_staff_title
source: Work as staff
uz: Xodim sifatida ishlash

# worker_type_label
source: Worker type
uz: Xodim turi

# initial_status_label
source: Initial status
uz: Boshlang‘ich holat

# enable_me_as_worker
source: Enable me as a worker
uz: Meni xodim sifatida yoqish

# enabling_ellipsis
source: Enabling…
uz: Yoqilmoqda…

source: Re-enable me
uz: Qayta yoqish

# reenabling_ellipsis
source: Re-enabling…
uz: Qayta yoqilmoqda…

# removed_from_team_hint
source: You are currently removed from the team.
uz: Hozirda siz jamoadan o‘chirilgansiz.

# enable_hint_after
source: You’ll be able to set your hours and assign services to yourself after enabling.
uz: Faollashtirgandan so‘ng soatlaringiz va xizmatlaringizni o‘zingizga belgilaysiz.

# owner_enabled_as_worker
source: You are now enabled as a worker
uz: Endi siz xodim sifatida faollashdingiz

source: Worker profile re-enabled
uz: Xodim profili qayta yoqildi

# worker_status_available
source: Available
uz: Mavjud

# worker_status_unavailable
source: Unavailable
uz: Mavjud emas

# worker_status_on_break
source: On break
uz: Tanaffusda

# worker_status_on_leave
source: On leave
uz: Ta’til

# action_edit
source: Edit
uz: Tahrirlash

# deleted_ok
source: Deleted
uz: O‘chirildi

# activated_ok
source: Activated
uz: Faollashtirildi

# deactivated_ok
source: Deactivated
uz: Faolsizlantirildi

source: Missing service id
uz: Xizmat ID topilmadi

# filter_active_only
source: Active only
uz: Faqat aktiv

source: No services yet
uz: Hozircha xizmatlar yo‘q

# services_count
source: {count, plural, one {# service} other {# services}}
uz: {count, plural, one {# xizmat} other {# xizmat}}

# status_active
source: Active
uz: Aktiv

# duration_hm
source: {h}h {m}m
uz: {h}s {m}d

# duration_h
source: {h}h
uz: {h}s

# duration_m
source: {m}m
uz: {m}d

# currency_sum
source: sum
uz: so'm

# unit_service_singular
source: service
uz: xizmat

# unit_service_plural
source: services
uz: xizmatlar

source: More
uz: Ko‘proq

# category_clinic
source: Clinic
uz: Klinika

# category_beauty_salon
source: Beauty salon
uz: Goʻzallik saloni

# category_dental
source: Dental
uz: Stomatologiya

# category_gym
source: Gym / Fitness
uz: Sport zali

# category_tattoo
source: Tattoo studio
uz: Tatuirovka studiyasi

# category_nail_salon
source: Nail salon
uz: Manikyur saloni

# category_massage
source: Massage
uz: Massaj

# category_other
source: Other
uz: Boshqa

source: Location pinned
uz: Joylashuv belgilandi

# pick_on_map_first
source: Please pin location on the map
uz: Iltimos, xaritada joylashuvni belgilang

source: Address
uz: Manzil

source: Map pin
uz: Xaritadagi belgi

source: Pick on map
uz: Xaritadan tanlash

source: Available
uz: Mavjud

source: On break
uz: Tanaffusda

source: On leave
uz: Taʼtilda

source: Unavailable
uz: Mavjud emas

source: Show inactive workers
uz: Nofaol ishchilarni ko‘rsatish

source: Show inactive receptionists
uz: Nofaol administratorlarni ko‘rsatish

source: Receptionist
uz: Administrator

source: Add staff
uz: Xodim qo‘shish

source: Add worker
uz: Ishchi qo‘shish

source: Add receptionist
uz: Administrator qo‘shish

source: Status
uz: Holat

# remove_worker_q
source: Remove worker?
uz: Xodimni olib tashlaysizmi?

# remove_worker_desc
source: The worker will be removed from the team (their account will not be deleted).
uz: Xodim jamoadan olib tashlanadi (akkaunti o‘chirilmaydi).

source: Remove
uz: Olib tashlash

source: Removed from team
uz: Jamoadan olib tashlandi

source: Worker activated
uz: Xodim faollashtirildi

source: Male
uz: Erkak

source: Female
uz: Ayol

source: Other
uz: Boshqa

source: Change status
uz: Holatni o‘zgartirish

source: Details
uz: Tafsilotlar

source: Provider
uz: Tashkilot

source: Role
uz: Roli

source: Manage
uz: Boshqarish

source: Danger zone
uz: Xavfli hudud

source: Remove from team
uz: Jamoadan olib tashlash

source: Reactivate worker
uz: Xodimni qayta faollashtirish

source: Edit worker
uz: Xodimni tahrirlash

source: Identity
uz: Shaxsiy maʼlumotlar

# gender_male
source: Male
uz: Erkak

# gender_female
source: Female
uz: Ayol

# gender_other
source: Other
uz: Boshqa

# phone_hint
source: Enter phone number
uz: Telefon raqamini kiriting

# email_hint
source: Enter email address
uz: Email manzilini kiriting

# role_worker_type
source: Worker type
uz: Xodim turi

# role_hairdresser
source: Hairdresser
uz: Soch turmakchisi

# role_dentist
source: Dentist
uz: Stomatolog

# role_doctor
source: Doctor
uz: Shifokor

# role_nurser
source: Nurse
uz: Hamshira

# role_spa_therapist
source: Spa therapist
uz: Spa terapevt

# role_masseuse
source: Masseuse
uz: Massajchi

# role_nail_technician
source: Nail technician
uz: Manikyur ustasi

# role_cosmetologist
source: Cosmetologist
uz: Kosmetolog

# role_tattoo_artist
source: Tattoo artist
uz: Tatuirovka ustasi

# role_personal_trainer
source: Personal trainer
uz: Shaxsiy murabbiy

# role_makeup_artist
source: Makeup artist
uz: Vizajist

# role_physiotherapist
source: Physiotherapist
uz: Fizioterapevt

# role_general
source: General
uz: Umumiy

# role_other
source: Other
uz: Boshqa

source: Hire date
uz: Ishga qabul qilingan sana

source: Name
uz: Ism

source: Edit receptionist
uz: Administratorni tahrirlash

source: Reactivate receptionist
uz: Administratorni qayta faollashtirish

source: Receptionist reactivated
uz: Administrator qayta faollashtirildi

# remove_receptionist_q
source: Remove receptionist?
uz: Administrator olib tashlansinmi?

# remove_receptionist_desc
source: The receptionist will be removed from the team (their account will not be deleted).
uz: Administrator jamoadan olib tashlanadi (akkaunti o‘chirilmaydi).

source: Only active
uz: Faqat faol

source: Only assigned
uz: Faqat biriktirilgan

# service_inactive
source: Inactive service
uz: Nofaol xizmat

source: Assign visible
uz: Ko‘rinadiganlarni biriktirish

source: Remove visible
uz: Ko‘rinadiganlarni olib tashlash

source: Added
uz: Qo‘shildi

source: Removed
uz: Olib tashlandi

source: No services found
uz: Hech qanday xizmat topilmadi

# no_services_found_caption
source: Try adjusting your filters or search query.
uz: Filtrlarni yoki qidiruvni o‘zgartirib ko‘ring.

source: Current password
uz: Joriy parol

# current_password_hint
source: Enter current password
uz: Joriy parolni kiriting

# current_password_required
source: Current password is required
uz: Joriy parol talab qilinadi

# current_password_incorrect
source: Current password is incorrect
uz: Joriy parol noto‘g‘ri

source: New password
uz: Yangi parol

# new_password_hint
source: Enter new password
uz: Yangi parolni kiriting

source: Confirm new password
uz: Yangi parolni tasdiqlang

# confirm_new_password_hint
source: Re-enter new password
uz: Yangi parolni qayta kiriting
