Repository: fatkhullakh/navbatuz-frontend
Catalog: lib/l10n/app_*.arb
Languages: uz

# navHome
source: Home
uz: Bosh sahifa

# navAppointments
source: Appointments
uz: Uchrashuvlar

# navSearch
source: Search
uz: Qidiruv

# navAccount
source: Account
uz: Hisob

# home_search_hint
source: Search services or businesses
uz: Xizmat yoki biznes qidiring

source: Categories
uz: Kategoriyalar

source: No categories.
uz: Kategoriyalar yo‘q.

source: Upcoming appointment
uz: Yaqin uchrashuv

# no_upcoming
source: No upcoming appointments.
uz: Yaqin uchrashuvlar yo‘q.

source: Favorites
uz: Sevimlilar

source: Recommended
uz: Tavsiya etilgan

# no_recommended
source: No recommendations right now.
uz: Hozircha tavsiyalar yo‘q.

source: See all
uz: Hammasini ko‘rish

# error_home_failed
source: Failed to load home. Pull to refresh.
uz: Bosh sahifa yuklanmadi. Yangilash uchun pastga torting.

# btn_go_appointments
source: Go to my appointments →
uz: Uchrashuvlarimga o‘tish →

# account_title
source: Account
uz: Hisob

# account_personal
source: Personal Info
uz: Shaxsiy ma’lumot

# account_personal_sub
source: Name, Surname, Email, Phone, Birthday, Gender
uz: Ism, Familiya, Email, Telefon, Tug‘ilgan kun, Jins

source: Account Settings
uz: Hisob sozlamalari

# account_settings_sub
source: Language, Country
uz: Til, Mamlakat

# account_change_password
source: Change Password
uz: Parolni o‘zgartirish

# account_change_password_sub
source: Update your password
uz: Parolingizni yangilang

# account_support
source: Support
uz: Yordam

# account_support_sub
source: FAQ, Contact Us, Report a problem
uz: FAQ, Aloqa, Muammo haqida xabar berish

# account_other
source: Other
uz: Boshqa

# account_other_sub
source: About, Terms, Privacy
uz: Haqimizda, Shartlar, Maxfiylik

source: Log out
uz: Chiqish

# settingsTitle
source: Settings
uz: Sozlamalar

# settingsLanguage
source: Language
uz: Til

# settingsChangePassword
source: Change password
uz: Parolni o‘zgartirish

# settings_country
source: Country
uz: Mamlakat

# settings_country_hint
source: Country ISO-2
uz: ISO-2 mamlakat kodi

# action_save
source: Save
uz: Saqlash

# action_retry
source: Retry
uz: Qayta urinish

# action_reload
source: Reload
uz: Yangilash

# provider_tab_services
source: Services
uz: Xizmatlar

# provider_tab_reviews
source: Reviews
uz: Sharhlar

# provider_tab_details
source: Manage
uz: Boshqaruv

# provider_about
source: About
uz: Haqida

# provider_category
source: Category
uz: Kategoriya

# provider_address
source: Address
uz: Manzil

# provider_contacts
source: Contacts
uz: Kontaktlar

# provider_phone_label
source: Phone
uz: Telefon

# provider_team
source: Workers
uz: Xodimlar

# provider_hours
source: Working hours
uz: Ish vaqti

# provider_closed
source: Closed
uz: Yopiq

# provider_retry
source: Retry
uz: Qayta urinish

# provider_no_services
source: No services.
uz: Xizmatlar yo‘q.

# provider_no_reviews
source: No reviews yet.
uz: Hozircha sharhlar yo‘q.

# provider_book
source: Book
uz: Band qilish

# provider_free
source: FREE
uz: BEKORGA

# provider_favourite
source: Favourite
uz: Sevimlilarga

# provider_favourited
source: Favourited
uz: Sevimlida

# booking_title
source: Book an Appointment
uz: Navbatga yozilish

# booking_anyone
source: Anyone
uz: Istalgan

# booking_slots_retry
source: Retry
uz: Qayta urinish

# booking_no_slots
source: No free slots for this day.
uz: Bu kunda bo‘sh vaqt yo‘q.

# booking_book
source: Book
uz: Band qilish

# booking_worker
source: Worker
uz: Xodim

# booking_service
source: Service
uz: Xizmat

# booking_time
source: Time
uz: Vaqt

# providerTabServices
source: SERVICES
uz: XIZMATLAR

# providerTabReviews
source: REVIEWS
uz: SHARHLAR

# providerTabDetails
source: DETAILS
uz: MAʼLUMOT

# providerAbout
source: About
uz: Haqida

# providerCategory
source: Category
uz: Kategoriya

# providerAddress
source: Address
uz: Manzil

# providerContact
source: Contact
uz: Aloqa

# providerWorkingHours
source: Working hours
uz: Ish vaqti

# providerWorkers
source: Staff
uz: Hodimlar

# providerNoWorkers
source: No staff listed.
uz: Hodimlar ko‘rsatilmagan.

# providerNoServices
source: No services.
uz: Xizmatlar yo‘q.

# providerFavourite
source: Favourite
uz: Sevimlilarga

# providerFavourited
source: Favourited
uz: Sevimlilarda

source: No reviews yet.
uz: Hozircha sharhlar yo‘q.

source: FREE
uz: BEKOR

# actionBook
source: Book
uz: Band qilish

# actionRetry
source: Retry
uz: Qayta urinib ko‘ring

# errorGeneric
source: Failed to load
uz: Yuklab bo‘lmadi

source: Closed
uz: Yopiq

# dayMonday
source: Monday
uz: Dushanba

# dayTuesday
source: Tuesday
uz: Seshanba

# dayWednesday
source: Wednesday
uz: Chorshanba

# dayThursday
source: Thursday
uz: Payshanba

# dayFriday
source: Friday
uz: Juma

# daySaturday
source: Saturday
uz: Shanba

# daySunday
source: Sunday
uz: Yakshanba

# bookingTitle
source: Book an Appointment
uz: Uchrashuvni band qilish

# bookingPickWorker
source: Choose a staff
uz: Xodimni tanlang

# bookingPickTime
source: Choose a time
uz: Vaqtni tanlang

# bookingNoSlotsDay
source: No availability for this day.
uz: Bu kunda bo'sh vaqt yo'q.

source: Anyone
uz: Istalgan

source: Pick date
uz: Sana tanlash

# withWorker
source: with
uz: bilan

# timeRange
source: Time
uz: Vaqt

# reviewTitle
source: Review and confirm
uz: Ko‘rib chiqing va tasdiqlang

# howPay
source: How would you like to pay?
uz: Qanday to‘laysiz?

# payCash
source: Cash
uz: Naqd

# confirmAndBook
source: Confirm & Book
uz: Tasdiqlash va band qilish

source: Subtotal
uz: Jami

# bookingSuccessTitle
source: Appointment booked!
uz: Uchrashuv band qilindi!

# bookingSuccessDesc
source: You’re all set. See you soon.
uz: Hammasi tayyor. Ko‘rishguncha!

# continueLabel
source: Continue
uz: Davom etish

# appointment_details_title
source: Appointment Details
uz: Uchrashuv tafsilotlari

# appointments_upcoming_title
source: Upcoming Appointments
uz: Kelgusi uchrashuvlar

# appointments_finished_title
source: Finished Appointments
uz: Tugallangan uchrashuvlar

# appointments_empty
source: You don't have any appointments yet.
uz: Sizda hali hech qanday uchrashuv yo‘q.

# appointment_cancel_button
source: Cancel appointment
uz: Uchrashuvni bekor qilish

# appointment_cancel_confirm_title
source: Cancel appointment?
uz: Uchrashuv bekor qilinsinmi?

# appointment_cancel_confirm_body
source: This action cannot be undone.
uz: Bu amalni qaytarib bo‘lmaydi.

# appointment_cancel_confirm_yes
source: Yes, cancel
uz: Ha, bekor qil

# appointment_cancel_success
source: Appointment canceled
uz: Uchrashuv bekor qilindi

# appointment_cancel_too_late
source: Too late to cancel.
uz: Bekor qilish uchun kech.

# appointment_cancel_too_late_with_window
source: Too late to cancel (within {minutes} min window).
uz: Bekor qilish uchun kech (qolgan vaqt {minutes} daqiqa).

# appointment_cancel_failed_generic
source: Cancel failed: {code}
uz: Bekor qilish muvaffaqiyatsiz: {code}

# appointment_cancel_failed_unknown
source: Cancel failed. Please try again.
uz: Bekor qilish amalga oshmadi. Qaytadan urinib ko‘ring.

# error_session_expired
source: Session expired. Please login again.
uz: Sessiya tugadi. Qayta tizimga kiring.

# appointment_staff_label
source: Staff
uz: Xodim

# common_no
source: No
uz: Yo‘q

# common_back
source: Back
uz: Orqaga

# common_cancelling
source: Cancelling…
uz: Bekor qilinmoqda…

# common_service
source: Service
uz: Xizmat

# common_provider
source: Provider
uz: Provayder

# providers_title
source: Providers
uz: Xizmat ko‘rsatuvchilar

# favorites_title
source: Favorite shops
uz: Sevimli do‘konlar

# favorites_empty
source: You haven't added any favorites yet.
uz: Siz hali sevimlilarga hech narsa qo‘shmagansiz.

# providers_empty
source: No providers to show.
uz: Xizmat ko‘rsatuvchilar topilmadi.

# error_favorites_failed
source: Failed to load favorites.
uz: Sevimlilarni yuklashda xatolik.

# favorites_added_snack
source: Added to favorites
uz: Sevimlilarga qo‘shildi

# favorites_removed_snack
source: Removed from favorites
uz: Sevimlilardan olib tashlandi

# favorites_toggle_failed
source: Could not update favorite. Please try again.
uz: Sevimlilarni yangilab bo‘lmadi. Iltimos, qayta urinib ko‘ring.

source: Providers
uz: Xizmat ko‘rsatuvchilar

source: No results
uz: Natijalar topilmadi

# no_favorites
source: You have no favorite shops yet.
uz: Sevimli do‘konlaringiz hali yo‘q.

source: Remove from favorites
uz: Sevimlilardan olib tashlash

# error_generic
source: Provider is not selected
uz: Provider tanlanmagan

# provider_change_logo
source: Change logo
uz: Logotipni o‘zgartirish

# action_pick_from_gallery
source: Pick from gallery
uz: Galereyadan tanlash

# action_take_photo
source: Take a photo
uz: Suratga olish

# provider_logo_updated
source: Logo updated
uz: Logotip yangilandi

# error_upload_failed
source: Upload failed
uz: Yuklash amalga oshmadi

# action_change_photo
source: Change photo
uz: Rasmni o'zgartirish

# action_remove_photo
source: Remove photo
uz: Rasmni o'chirish

# action_view_photo
source: View photo
uz: Rasmni ko'rish

source: Search
uz: Qidiruv

source: Services
uz: Xizmatlar

source: All
uz: Barchasi

# cat_barbershop
source: Barbershop
uz: Sartaroshxona

# cat_dental
source: Dental
uz: Stomatologiya klinikasi

# cat_clinic
source: Clinic
uz: Tibbiyot klinikasi

# cat_gym
source: Gym
uz: Sport zali

# cat_nail_salon
source: Nail salon
uz: Tirnoq saloni

# cat_beauty_clinic
source: Beauty clinic
uz: Go'zallik klinikasi

# cat_tattoo_studio
source: Tattoo studio
uz: Tatuirovka studiyasi

# cat_massage_center
source: Massage center
uz: Massaj markazi

# cat_physiotherapy_clinic
source: Physiotherapy
uz: Fizioterapiya klinikasi

# cat_makeup_studio
source: Makeup studio
uz: Makiyaj studiyasi

# appointments_title
source: Appointments
uz: Qabullar

# appointments_upcoming
source: Upcoming Appointments
uz: Yaqinlashayotgan uchrashuvlar

# appointments_finished
source: Finished Appointments
uz: Tugallangan uchrashuvlar

# appointment_action_cancel
source: Cancel
uz: Bekor qilish

# appointment_action_book_again
source: Book again
uz: Qayta bron qilish

# provider_nav_appointments
source: Appointments
uz: Uchrashuvlar

# provider_nav_dashboard
source: Dashboard
uz: Panel

# provider_nav_manage
source: Manage
uz: Boshqarish

# provider_nav_account
source: Account
uz: Profil

# provider_appt_today_title
source: Today’s schedule
uz: Bugungi jadval

# provider_appt_today_subtitle
source: Hook this up to your provider/worker appointments.
uz: Bu yerda provayder/xodim uchrashuvlari bo‘ladi.

# common_coming_soon
source: Coming soon
uz: Tez orada

# provider_dashboard_coming_soon_desc
source: Analytics and revenue overview will be here.
uz: Analitika va daromadlar shu yerda ko‘rsatiladi.

# provider_manage_services_title
source: Services
uz: Xizmatlar

# provider_manage_services_subtitle
source: Create, edit and sort services
uz: Xizmatlarni yaratish, tahrirlash va tartiblash

# provider_manage_business_title
source: Business Info
uz: Biznes ma’lumotlari

# provider_manage_business_subtitle
source: Name, description, address, contacts
uz: Nom, tavsif, manzil, kontaktlar

# provider_manage_staff_title
source: Staff
uz: Xodimlar

# provider_manage_staff_subtitle
source: Add/edit workers and assign services
uz: Xodim qo‘shish/tahrirlash va xizmat biriktirish

# provider_manage_hours_title
source: Working hours
uz: Ish vaqtlari

# provider_manage_hours_subtitle
source: Set weekly hours and overrides
uz: Haftalik ish vaqtlari va istisnolar

# provider_action_add_service
source: Add service
uz: Xizmat qo‘shish

# provider_action_add_staff
source: Add staff
uz: Xodim qo‘shish

# provider_account_hint
source: Profile, language, logout…
uz: Profil, til, chiqish…

# provider_services_hint
source: List and create/edit services
uz: Xizmatlar ro‘yxati va yaratish/tahrirlash oynasi

# provider_business_hint
source: Name, description, address, email, phone, logo
uz: Nom, tavsif, manzil, email, telefon, logo

# provider_staff_hint
source: List workers, add/edit, assign services
uz: Xodimlar ro‘yxati, qo‘shish/tahrirlash, xizmat biriktirish

# provider_hours_hint
source: Weekly grid editor and exceptions
uz: Haftalik jadval tahrirlash va istisnolar

# services_title
source: Services
uz: Xizmatlar

# action_refresh
source: Refresh
uz: Yangilash

# action_add
source: Add
uz: Qo‘shish

# search_services_hint
source: Search services…
uz: Xizmatlarni qidirish…

# no_data
source: No services yet
uz: Hali xizmatlar yoʻq

# service_create
source: Create service
uz: Xizmat yaratish

# main_details_required
source: Main details
uz: Asosiy ma'lumotlar

# service_name
source: Name
uz: Nomi

source: Required
uz: Majburiy

source: Price
uz: Narxi

# service_duration
source: Duration
uz: Davomiyligi

# service_description
source: Description
uz: Tavsif

source: Photos
uz: Rasmlar

source: Not set
uz: Belgilanmagan

source: Active
uz: Faol

source: Add photo
uz: Rasm qoʻshish

source: Image updated
uz: Rasm yangilandi

source: Image removed
uz: Rasm olib tashlandi

# error_upload_image
source: Upload failed
uz: Yuklash muvaffaqiyatsiz

# error_remove_image
source: Remove failed
uz: Olib tashlashda xatolik

# manage_title
source: Manage
uz: Boshqaruv

# manage_services_title
source: Services
uz: Xizmatlar

# manage_services_subtitle
source: Create, edit, and organize services
uz: Xizmatlarni yaratish, tahrirlash va tartiblash

# manage_business_info_title
source: Business info
uz: Biznes ma’lumotlari

# manage_business_info_subtitle
source: Name, contacts, address, about
uz: Nomi, kontaktlar, manzil, haqida

# manage_staff_title
source: Staff
uz: Xodimlar

# manage_staff_subtitle
source: Invite and manage workers
uz: Xodimlarni taklif qiling va boshqaring

# manage_hours_title
source: Working hours
uz: Ish vaqti

# manage_hours_subtitle
source: Set business schedule and breaks
uz: Ish jadvali va tanaffuslarni sozlang

# prov_nav_dashboard
source: Dashboard
uz: Boshqaruv paneli

# prov_nav_manage
source: Manage
uz: Boshqaruv

# action_delete
source: Delete
uz: O‘chirish

# action_cancel
source: Cancel
uz: Bekor qilish

# confirm_delete_title
source: Delete service?
uz: Xizmatni o‘chirish?

# confirm_delete_msg
source: This action cannot be undone.
uz: Bu amalni bekor qilib bo‘lmaydi.

source: Staff members
uz: Xodimlar

source: Invalid
uz: Noto‘g‘ri

source: Working hours
uz: Ish vaqti

source: Saved
uz: Saqlandi

source: Select time
uz: Vaqtni tanlang

source: Start
uz: Boshlanishi

source: End
uz: Tugashi

# action_done
source: Done
uz: Tayyor

source: Copy Monday to all
uz: Dushanba jadvalini barchasiga ko‘chirish

source: Close all
uz: Barchasini yopish

source: Mon–Fri
uz: Du–Ju

source: Deleted
uz: O‘chirilgan

source: Business info
uz: Biznes ma'lumotlari

source: Change logo
uz: Logoni o‘zgartirish

# remove_logo
source: Remove
uz: O‘chirish

# provider_name
source: Name
uz: Nom

source: Category
uz: Kategoriya

source: Team size
uz: Jamoa soni

source: About
uz: Tavsif

source: Contact
uz: Aloqa

source: Phone
uz: Telefon

source: Location
uz: Joylashuv

source: Address line 1
uz: Manzil (1-qator)

source: Address line 2
uz: Manzil (2-qator)

source: District
uz: Tuman

source: City
uz: Shahar

source: Country ISO2
uz: Mamlakat (ISO2)

source: Postal code
uz: Pochta indeksi

source: Use current location
uz: Joriy joylashuvdan foydalanish

# location_permission_needed
source: Location permission required
uz: Joylashuv ruxsati talab qilinadi

source: Apply
uz: Qo'llash

source: Edit
uz: Tahrirlash

# business_info_title
source: Business info
uz: Biznes ma'lumotlari

# business_details_tab
source: Details
uz: Tafsilotlar

# business_photos_tab
source: Photos
uz: Rasmlar

# business_location_tab
source: Location
uz: Manzil

# business_details_title
source: Business details
uz: Biznes maʼlumotlari

# company_name_label
source: Name
uz: Nomi

source: Invalid email
uz: Noto‘g‘ri email

source: Upload logo
uz: Logo yuklash

source: Take photo
uz: Rasmga olish

# gallery_title
source: Portfolio / Interior
uz: Portfel / Interyer

source: Add photos
uz: Rasm qo‘shish

# gallery_hint
source: Upload interior/portfolio photos (not persisted yet).
uz: Interyer/portfel rasmlarini yuklang (hozircha saqlanmaydi).

# location_details_title
source: Location details
uz: Manzil tafsilotlari

source: Country
uz: Mamlakat

# pin_on_map_title
source: Pin location (lat, lng)
uz: Joylashuv nuqtasi (kenglik, uzunlik)

source: Set pin
uz: Nuqtani belgilash

# set_coordinates_title
source: Set coordinates
uz: Koordinatalarni belgilang

# latitude_label
source: Latitude (-90..90)
uz: Kenglik (-90..90)

# longitude_label
source: Longitude (-180..180)
uz: Uzunlik (-180..180)

source: Use this pin
uz: Shu pinni ishlatish

source: Enter valid numbers
uz: To‘g‘ri son kiriting

source: Out of range
uz: Ruxsat etilgan oraliqdan tashqarida

# phone_enter_digits_range
source: Enter {min}–{max} digits
uz: {min}–{max} ta raqam kiriting

# location_services_disabled
source: Location services are disabled
uz: Joylashuv xizmati o‘chirilgan

source: Location permission denied
uz: Joylashuvga ruxsat berilmadi

source: No pin set
uz: Pin qo‘yilmagan

# pick_location_title
source: Pick location
uz: Joylashuvni tanlang

# business_settings_title
source: Business settings
uz: Biznes sozlamalari

# business_details_subtitle
source: Name, description, email, phone, category, logo
uz: Nom, tavsif, email, telefon, toifa, logo

source: Select category
uz: Toifani tanlang

source: Save
uz: Saqlash

source: Saving…
uz: Saqlanmoqda…

# location_pick_on_map
source: Pick on map
uz: Xaritadan tanlash

# location_no_pin
source: No pin set
uz: Pin qo‘yilmagan

# working_hours_subtitle
source: Set business hours
uz: Ish vaqtlarini sozlash

# staff_title
source: Staff
uz: Xodimlar

# staff_add_member
source: Add staff
uz: Xodim qo‘shish

# staff_search_hint
source: Search name or phone…
uz: Ism yoki telefon bo‘yicha qidirish…

# staff_show_inactive
source: Show inactive
uz: Noaktivlarni ko‘rsatish

# staff_invite_title
source: Invite staff
uz: Xodimni taklif qilish

# staff_edit_title
source: Edit staff
uz: Xodimni tahrirlash

# staff_role
source: Role
uz: Roli

# role_owner
source: Owner
uz: Ega

# role_receptionist
source: Receptionist
uz: Administrator

# role_worker
source: Staff
uz: Xodim

# staff_remove_confirm_title
source: Remove member?
uz: Xodim o‘chirilsinmi?

# staff_remove_confirm_msg
source: This action cannot be undone.
uz: Bu amalni qaytarib bo‘lmaydi.

source: Invite
uz: Taklif qilish

source: Inactive
uz: Noaktiv

# action_remove
source: Remove
uz: Olib tashlash

# action_deactivate
source: Deactivate
uz: O‘chirish

# action_activate
source: Activate
uz: Faollashtirish

# person_name
source: Name
uz: Ism

source: Manage services
uz: Xizmatlarni boshqarish

source: Edit availability
uz: Ish jadvalini tahrirlash

source: Activate
uz: Faollashtirish

source: Deactivate
uz: Faolsizlantirish

# invite_worker_title
source: Add & Invite worker
uz: Xodimni qo‘shish va taklif qilish

source: Personal info
uz: Shaxsiy ma’lumotlar

source: First name
uz: Ism

source: Last name
uz: Familiya

source: Upload avatar
uz: Avatar yuklash

source: Next
uz: Keyingi

source: Back
uz: Ortga

source: Create & send invite
uz: Yaratish va taklif yuborish

# invite_sent
source: Invitation sent
uz: Taklif yuborildi

source: Working this day
uz: Ushbu kunda ishlaydi

# breaks_title
source: Breaks
uz: Tanaffuslar

source: Add break
uz: Tanaffus qo‘shish

source: Select date
uz: Sana tanlang

# weekly_schedule
source: Weekly
uz: Haftalik

source: Exceptions
uz: Istisnolar

# exception_for_day
source: Exception for this day
uz: Shu kun uchun istisno

# delete_exception_title
source: Remove exception?
uz: Istisnoni o‘chirasizmi?

# delete_exception_msg
source: This will delete the exception for this day.
uz: Bu kunga qo‘yilgan istisno o‘chiriladi.

# breaks_for_day
source: Breaks for this day
uz: Ushbu kundagi tanaffuslar

source: No breaks.
uz: Tanaffuslar yo‘q.

# delete_break_title
source: Delete break?
uz: Tanaffusni o‘chirish?

# delete_break_msg
source: This action cannot be undone.
uz: Bu amalni qaytarib bo‘lmaydi.

# buffer_minutes
source: Buffer (min)
uz: Buffer (daq)

source: Activated
uz: Faollashtirildi

source: Deactivated
uz: O‘chirildi

# invite_flow_placeholder
source: This screen will register a new user (name, contacts, avatar), assign a role and send credentials via email/SMS.
uz: Bu yerda yangi foydalanuvchini (ism, aloqa, avatar) ro‘yxatdan o‘tkazish, rol berish va login/parolni email/SMS orqali yuborish bo‘ladi.

# staff_only_available
source: Show only available
uz: Faqat mavjudlarni ko‘rsatish

# tab_week
source: Week
uz: Hafta

# tab_exceptions
source: Exceptions
uz: Istisnolar

# tab_breaks
source: Breaks
uz: Tanaffuslar

source: Copy Mon → All
uz: Du ni → Hamma kunga nusxalash

source: Copy Mon → Fri
uz: Du ni → Du–Ju nusxalash

# copied_mon_all
source: Copied Monday to all days
uz: Dushanba barcha kunlarga nusxalandi

# copied_mon_fri
source: Copied Monday to Mon–Fri
uz: Dushanba Du–Ju ga nusxalandi

# buffer_min_short
source: Buffer (min)
uz: Buffer (daq)

# delete_exception
source: Delete this exception
uz: Istisnoni o‘chirish

# no_breaks_day
source: No breaks for this day.
uz: Tanaffuslar yo‘q.

source: Break added
uz: Tanaffus qo‘shildi

source: Only available
uz: Faqat mavjudlar

# time_select_title
source: Select time
uz: Vaqtni tanlang

# step_personal
source: Personal & contact
uz: Shaxsiy ma’lumotlar va kontaktlar

source: Surname
uz: Familiya

source: Gender
uz: Jinsi

source: Worker type
uz: Xodim turi

# action_invite
source: Create & send invite
uz: Yaratish va taklif yuborish

# invite_sent_title
source: Invitation sent
uz: Taklif yuborildi

# temp_password
source: Temporary password
uz: Vaqtinchalik parol

# invite_note_change_password
source: They will be asked to change the password on first login.
uz: Birinchi kirishda parolni almashtirish talab qilinadi.

source: Date of birth
uz: Tug‘ilgan sana

source: Language
uz: Til

source: No workers selected
uz: Xodim tanlanmagan

source: No appointments
uz: Qabul yo‘q

source: New appointment
uz: Yangi qabul

source: Worker
uz: Xodim

source: Date
uz: Sana

source: Guest details
uz: Mehmon ma’lumoti

# required_field
source: Required
uz: Majburiy

# fill_all_fields
source: Please fill all required fields
uz: Iltimos, majburiy maydonlarni to‘ldiring

source: Create
uz: Yaratish

source: Reschedule
uz: Ko‘chirish

source: No free slots
uz: Bo‘sh vaqtlar yo‘q

# calendar_view
source: Calendar
uz: Kalendar

# list_view
source: List
uz: Roʻyxat

source: Today
uz: Bugun

# weekday_mon_short
source: Mon
uz: Du

# weekday_tue_short
source: Tue
uz: Se

# weekday_wed_short
source: Wed
uz: Ch

# weekday_thu_short
source: Thu
uz: Pa

# weekday_fri_short
source: Fri
uz: Ju

# weekday_sat_short
source: Sat
uz: Sh

# weekday_sun_short
source: Sun
uz: Ya

source: No items
uz: Hech narsa yoʻq

# break_label
source: Break
uz: Tanaffus

# common_guest
source: Guest
uz: Mehmon

# common_customer
source: Customer
uz: Mijoz

# status_no_show
source: No-show
uz: Kelmagan

# status_label
source: Status
uz: Holat

# status_booked
source: Booked
uz: Bron qilingan

# status_completed
source: Completed
uz: Yakunlandi

# status_cancelled
source: Canceled
uz: Bekor qilindi

# status_rescheduled
source: Rescheduled
uz: Qayta belgilandi

# action_mark_no_show
source: Mark no-show
uz: Kelmagan deb belgilash

# action_undo_no_show
source: Undo no-show
uz: Kelmagan belgisini olib tashlash

# toast_marked_no_show
source: Marked as no-show
uz: Kelmagan deb belgilandi

# toast_undo_no_show
source: No-show undone
uz: Kelmagan belgisi olib tashlandi

# appointment_no_actions
source: No actions available for this status.
uz: Bu holat uchun amal yo‘q.

source: Walk-in
uz: Navbatda

source: Pick client
uz: Mijozni tanlash

source: Pick from contacts
uz: Kontaktlardan tanlash
